USE module_6_matskiv;
GO

/*1.Написати команду, яка повертає список продуктів, складений в алфавітному порядку міст де вони знаходяться + порядковий номер деталі в списку (наскрізна нумерація для порядкового номера). */

GO

/*2.Написати команду, яка повертає список продуктів, складений в алфавітному порядку міст де вони знаходяться + порядковий номер в межах одного міста (відсортований за іменем продукту). */

GO

/*3.Використовуючи за основу попередній запит написати запит, який повертає міста з порядковим номером 1. */

GO

/*4.Написати запит, який повертає список продуктів, деталей, їхні поставки,  загальну кількість поставок для кожного продукту і загальну кількість поставок для кожної деталі. */

GO

/*5.Організувати посторінковий вивід інформації з таблиці поставок, відсортований за  постачальниками, вивести записи з 10 по 15 запис, додатково вивести порядковий номер стрічки і загальну кількість записів у таблиці поставок. */

GO

/*6.Написати запит, що розраховує середню кількість елементів в поставці і виводить ті поставки, де кількість елементів менше середньої. */

GO